In [1]:
import pandas as pd

## How to read a file, with separators and adding headers?

In [11]:
orders = pd.read_table('data/chipotle.tsv', sep = "\t")

In [12]:
orders.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [15]:
user_cols = ['user_id', 'age', 'gender', 'occupation', 'zip_code']
pd.read_table("http://bit.ly/movieusers", sep = "|", names=user_cols).head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

## How to select a Pandas series from a dataframe?

In [17]:
ufo = pd.read_csv('data/ufo.csv')
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [23]:
ufo.shape

(18241, 5)

In [26]:
ufo['CityTime'] = ufo.City + " , " + ufo.Time
ufo['CityTime'].head()

0                   Ithaca , 6/1/1930 22:00
1             Willingboro , 6/30/1930 20:00
2                 Holyoke , 2/15/1931 14:00
3                  Abilene , 6/1/1931 13:00
4    New York Worlds Fair , 4/18/1933 19:00
Name: CityTime, dtype: object

## Why do some commands end with paranthesis and others don't?

In [27]:
movies = pd.read_csv('data/imdb_1000.csv')
movies.head()

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."

In [41]:
movies.describe()

       star_rating    duration
count   979.000000  979.000000
mean      7.889785  120.979571
std       0.336069   26.218010
min       7.400000   64.000000
25%       7.600000  102.000000
50%       7.800000  117.000000
75%       8.100000  134.000000
max       9.300000  242.000000

In [42]:
movies.describe(include = ['object'])

,title,content_rating,genre,actors_list
count,979,976,979,979
unique,975,12,16,969
top,The Girl with the Dragon Tattoo,R,Drama,"[u'Daniel Radcliffe', u'Emma Watson', u'Rupert..."
freq,2,460,278,6

In [44]:
movies.dtypes

star_rating       float64
title              object
content_rating     object
genre              object
duration            int64
actors_list        object
dtype: object

## How do I rename columns in a dataframe?

In [45]:
ufo.columns

Index([u'City', u'Colors Reported', u'Shape Reported', u'State', u'Time',
       u'CityTime'],
      dtype='object')

In [48]:
ufo.rename(columns={'Colors Reported':'ColorsReported'});
ufo.head()
ufo.rename(columns={'ColorsReported':'Colors Reported'})

,City,ColorsReported,Shape Reported,State,Time,CityTime
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,"Ithaca , 6/1/1930 22:00"
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Willingboro , 6/30/1930 20:00"
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,"Holyoke , 2/15/1931 14:00"
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,"Abilene , 6/1/1931 13:00"
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,"New York Worlds Fair , 4/18/1933 19:00"
5,Valley City,NaN,DISK,ND,9/15/1934 15:30,"Valley City , 9/15/1934 15:30"
6,Crater Lake,NaN,CIRCLE,CA,6/15/1935 0:00,"Crater Lake , 6/15/1935 0:00"
7,Alma,NaN,DISK,MI,7/15/1936 0:00,"Alma , 7/15/1936 0:00"
8,Eklutna,NaN,CIGAR,AK,10/15/1936 17:00,"Eklutna , 10/15/1936 17:00"
9,Hubbard,NaN,CYLINDER,OR,6/15/1937 0:00,"Hubbard , 6/15/1937 0:00"
10,Fontana,NaN,LIGHT,CA,8/15/1937 21:00,"Fontana , 8/15/1937 21:00"
11,Waterloo,NaN,FIREBALL,AL,6/1/1939 20:00,"Waterloo , 6/1/1939 20:00"
12,Belton,RED,SPHERE,SC,6/30/1939 20:00,"Belton , 6/30/1939 20:00"
13,Keokuk,NaN,OVAL,IA,7/7/1939 2:00,"Keokuk , 7/7/1939 2:00"
14,Ludington,NaN,DISK,MI,6/1/1941 13:00,"Ludington , 6/1/1941 13:00"
15,Forest Home,NaN,CIRCLE,CA,7/2/1941 11:30,"Forest Home , 7/2/1941 11:30"
16,Los Angeles,NaN,NaN,CA,2/25/1942 0:00,"Los Angeles , 2/25/1942 0:00"
17,Hapeville,NaN,NaN,GA,6/1/1942 22:30,"Hapeville , 6/1/1942 22:30"
18,Oneida,NaN,RECTANGLE,TN,7/15/1942 1:00,"Oneida , 7/15/1942 1:00"
19,Bering Sea,RED,OTHER,AK,4/30/1943 23:00,"Bering Sea , 4/30/1943 23:00"
20,Nebraska,NaN,DISK,NE,6/1/1943 15:00,"Nebraska , 6/1/1943 15:00"
21,NaN,NaN,NaN,LA,8/15/1943 0:00,NaN
22,NaN,NaN,LIGHT,LA,8/15/1943 0:00,NaN
23,Owensboro,NaN,RECTANGLE,KY,10/15/1943 11:00,"Owensboro , 10/15/1943 11:00"
24,Wilderness,NaN,DISK,WV,1/1/1944 10:00,"Wilderness , 1/1/1944 10:00"
25,San Diego,NaN,CIGAR,CA,1/1/1944 12:00,"San Diego , 1/1/1944 12:00"
26,Wilderness,NaN,DISK,WV,1/1/1944 12:00,"Wilderness , 1/1/1944 12:00"
27,Clovis,NaN,DISK,NM,4/2/1944 11:00,"Clovis , 4/2/1944 11:00"
28,Los Alamos,NaN,DISK,NM,6/1/1944 12:00,"Los Alamos , 6/1/1944 12:00"
29,Ft. Duschene,NaN,DISK,UT,6/30/1944 10:00,"Ft. Duschene , 6/30/1944 10:00"
...,...,...,...,...,...,...
18211,Holyoke,NaN,DIAMOND,MA,12/28/2000 18:00,"Holyoke , 12/28/2000 18:00"
18212,Carson,NaN,DISK,CA,12/28/2000 18:20,"Carson , 12/28/2000 18:20"
18213,Pasadena,GREEN,FIREBALL,CA,12/28/2000 19:10,"Pasadena , 12/28/2000 19:10"
18214,Austin,NaN,FORMATION,TX,12/29/2000 0:00,"Austin , 12/29/2000 0:00"
18215,El Campo,NaN,OTHER,TX,12/29/2000 9:00,"El Campo , 12/29/2000 9:00"
18216,Garden Grove,ORANGE,LIGHT,CA,12/29/2000 16:10,"Garden Grove , 12/29/2000 16:10"
18217,Berthoud Pass,NaN,TRIANGLE,CO,12/29/2000 19:30,"Berthoud Pass , 12/29/2000 19:30"
18218,Sisterdale,NaN,DIAMOND,TX,12/29/2000 20:00,"Sisterdale , 12/29/2000 20:00"
18219,Garden Grove,NaN,CHEVRON,CA,12/29/2000 20:30,"Garden Grove , 12/29/2000 20:30"
18220,Shasta Lake,BLUE,DISK,CA,12/29/2000 20:30,"Shasta Lake , 12/29/2000 20:30"
18221,Franklin,NaN,DISK,NH,12/29/2000 20:50,"Franklin , 12/29/2000 20:50"
18222,Albrightsville,NaN,OTHER,PA,12/29/2000 21:00,"Albrightsville , 12/29/2000 21:00"
18223,Greenville,NaN,NaN,SC,12/29/2000 22:00,"Greenville , 12/29/2000 22:00"
18224,Eufaula,NaN,DISK,OK,12/29/2000 23:30,"Eufaula , 12/29/2000 23:30"
18225,Simi Valley,NaN,FORMATION,CA,12/30/2000 10:00,"Simi Valley , 12/30/2000 10:00"
18226,San Francisco,NaN,FORMATION,CA,12/30/2000 22:00,"San Francisco , 12/30/2000 22:00"
18227,San Francisco,NaN,TRIANGLE,CA,12/30/2000 22:00,"San Francisco , 12/30/2000 22:00"
18228,Kingsville,NaN,LIGHT,TX,12/31/2000 4:00,"Kingsville , 12/31/2000 4:00"
18229,Chicago,NaN,DISK,IL,12/31/2000 11:45,"Chicago , 12/31/2000 11:45"
18230,Pismo Beach,NaN,OVAL,CA,12/31/2000 20:00,"Pismo Beach , 12/31/2000 20:00"
18231,Pismo Beach,NaN,OVAL,CA,12/31/2000 20:00,"Pismo Beach , 12/31/2000 20:00"
18232,Lodi,NaN,NaN,WI,12/31/2000 20:30,"Lodi , 12/31/2000 20:30"
18233,Anchorage,RED,VARIOUS,AK,12/31/2000 21:00,"Anchorage , 12/31/2000 21:00"
18234,Capitola,NaN,TRIANGLE,CA,12/31/2000 22:00,"Capitola , 12/31/2000 22:00"
18235,Fountain Hills,NaN,NaN,AZ,12/31/2000 23:00,"Fountain Hills , 12/31/2000 23:00"
18236,Grant Park,NaN,TRIANGLE,IL,12/31/2000 23:00,"Grant Park , 12/31/2000 23:00"
18237,Spirit Lake,NaN,DISK,IA,12/31/2000 23:00,"Spirit Lake , 12/31/2000 23:00"
18238,Eagle River,NaN,NaN,WI,12/31/2000 23:45,"Eagle River , 12/31/2000 23:45"
18239,Eagle River,RED,LIGHT,WI,12/31/2000 23:45,"Eagle River , 12/31/2000 23:45"
18240,Ybor,NaN,OVAL,FL,12/31/2000 23:59,"Ybor , 12/31/2000 23:59"